ibrahim_folder/cases/fan_test/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         5;
deltaT          1;
writeControl    timeStep;
writeInterval   5;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable yes;

functions
{
    // Mass flow at inlet
    massFlowInlet {
		type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        enabled         true;
        writeControl    timeStep;
        writeInterval   1;
        log             yes;
        writeFields     false;
        regionType      patch;
        name            velocity_inlet;
        operation       sum;
        fields          (phi);
	}

    // Mass flow at outlet
    massFlowOutlet {
		type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        enabled         true;
        writeControl    timeStep;
        writeInterval   1;
        log             yes;
        writeFields     false;
        regionType      patch;
        name            pressure_outlet;
        operation       sum;
        fields          (phi);
	}

    // Area-averaged velocity at outlet (gives Ux, Uy, Uz components)
    outletVelocity {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        enabled         true;
        writeControl    timeStep;
        writeInterval   1;
        log             yes;
        writeFields     false;
        regionType      patch;
        name            pressure_outlet;
        operation       areaAverage;
        fields          (U);
    }
}
