ibrahim_folder/cases/fan_test/constant/turbulenceProperties
FoamFile
{
      version 2.0;
      format ascii;
      class dictionary;
      location "constant";
      object turbulenceProperties;
}

simulationType RAS;

RAS
{
    RASModel        kOmegaSST;

    turbulence      on;
    printCoeffs     on;
}
