ibrahim_folder/cases/fan_test/system/fvSchemes
FoamFile
{
     version     2.0;
     format      ascii;
     class       dictionary;
     object      fvSchemes;
}

ddtSchemes
{
     default         steadyState;
}

gradSchemes
{
     default         leastSquares;
}

divSchemes
{
     div(phi,U)                  Gauss limitedLinearV 1;
     div(phi,k)                  Gauss upwind;
     div(phi,omega)              Gauss upwind;
     div((nuEff*dev2(T(grad(U)))))      Gauss linear;
     div(dev(tauEff))            Gauss linear;
}

laplacianSchemes
{
     default         Gauss linear corrected;
}

interpolationSchemes
{
     default         linear;
}

snGradSchemes
{
     default         corrected;
}

wallDist
{
     method          meshWave;
}
