ibrahim_folder/cases/fan_test/system/fvSolution
FoamFile
{
    version      2.0;
    format       ascii;
    class        dictionary;
    object       fvSolution;
}

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-07;
        relTol          0.01;
        smoother        GaussSeidel;
        nFinestSweeps   2;
        maxIter         100;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.1;
    }

    Phi
    {
        solver          GAMG;
        tolerance       1e-07;
        relTol          0.0;
        smoother        GaussSeidel;
        nFinestSweeps   2;
        maxIter         100;
    }

    k
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         2;
        tolerance       1e-07;
        relTol          0.1;
    }
    omega
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         2;
        tolerance       1e-07;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 4;
    pRefCell 0;
    pRefValue 0;
    residualControl
    {
        U 1e-5;
        p 1e-4;
        k 1e-5;
        omega 1e-5;
    }
    
    limiters
    {
        k           1e-15;
        omega       1e-15;
    }
}

relaxationFactors
{
    fields
    {
        p 0.3; 
        k 0.5;
        omega 0.;
    }
    equations
    {
        U 0.7;
    }
}
